---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.BeamFailures
source: html/f115c91a-0993-ab9d-f651-10532257dc5f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BeamFailures

Failures about Beams.

## Syntax (C#)
```csharp
public static class BeamFailures
```